---
kind: type
id: T:Autodesk.Revit.DB.HostedSweepType
source: html/1ae103ff-960e-a5e7-7a4f-c7c561ca5a3f.htm
---
# Autodesk.Revit.DB.HostedSweepType

An object that represents the attributes for sweep host objects
in Autodesk Revit.

## Syntax (C#)
```csharp
public class HostedSweepType : HostObjAttributes
```